public enum Value {
    اول(1),
    احد(1), // احد عشر
    احدى(1),
    حاد(1),
    حادية(1),
    حادي(1),
    ثاني(2),
   // ثانية(2),
    اثنا(2),
    ثلاث(3),
    ثالث(3),
    رابع(4),
    خامس(5),
    خمس(5),
    سادس(6),
    سادسة(6),
    سابع(7),
    سبع(7),
    ثامن(8),
    تاسع(9),
    عاشر(10),
    عشر(10),
    عشرون(20),
    ثلاثون(30),
    اربعون(40),
    خمسون(50),
    ستون(60),
    سبعون(70),
    ثمانون(80),
    تسعون(90);
    private final int value;

    private Value(int value) {
        this.value = value;
    }

    public int value() {
        return value;
    }
}
